org/dart_practice1.org
* [30-list] List 생성과 출력
- 대문자로 시작
- List는 data를 넣는 container, 어떤 data를 넣을 지 generic으로 선언해야 한다.

#+BEGIN_SRC dart
  void main(){
    print('==================');    
    List<String> member = ['a' 'b', 'c', 'd'];
    print(member);
    print('==================');    
    List<int> numbers = [1,2,3,4,5];
    print(numbers);
  }
#+END_SRC

#+RESULTS:
: ==================
: [ab, c, d]
: ==================
: [1, 2, 3, 4, 5]

* [31-List] List에서 값꺼내기
#+BEGIN_SRC dart
  void main(){
    List<String> members =['harry','George','john'];
    print(members[0]);
    print(members[1]);
    print(members[2]);    
  }
#+END_SRC

#+RESULTS:
: harry
: George
: john

* [32-List] 전체 List의 길이를 알기
- length를 사용

#+BEGIN_SRC dart
  void main(){
    List<String> members = ['harry','George', 'Jed'];
    print(members.length);
  }
#+END_SRC

#+RESULTS:
: 3

* [33-List] List의 add, remove, indexOf 함수 사용

#+BEGIN_SRC dart
  void main(){
    print('---------------------');
    List<String> members = ['harry','George','Jed'];
    members.add('ted');
    print(members);
    members.remove('harry');
    print(members);
    int num = members.indexOf('Jed');
    print(num);
  }
#+END_SRC

#+RESULTS:
: ---------------------
: [harry, George, Jed, ted]
: [George, Jed, ted]
: 1
* [34-Map] Map의 생성과 출력
- Map은 key value를 가진 하나의 객체다.
#+BEGIN_SRC dart
  void main(){
    Map<String,String> dict = {
      'age': '43',
      'name': 'holy',
      'address': 'jeju',
      };
      print(dict);
  }
#+END_SRC

#+RESULTS:
: {age: 43, name: holy, address: jeju}

* [35-Map] Map에 값을 추가하기 - addAll()
- addAll()에 인자로 Map을 추가하면 된다.
#+BEGIN_SRC dart
  void main(){
    Map<String,bool> casting = {
      "George": true,
    };
    casting.addAll(
      {"Jed": false,});
    print(casting);
  }
#+END_SRC

#+RESULTS:
: {George: true, Jed: false}

* [36-Map] Map에 값을 추가하기 - index사용
#+BEGIN_SRC dart
  void main(){
    Map<String,bool> casting = {
      "lingo": true,
      "George": true,
      "Queen": false,
      };
    casting['blur']=false;
    print(casting);
  }
#+END_SRC

#+RESULTS:
: {lingo: true, George: true, Queen: false, blur: false}

* [37-Map] Map의 값을 변경
#+BEGIN_SRC dart
  void main(){
    Map<String, bool> casting = {
      'jed': true,
      'George':false,
  };
  casting['jed'] = false;
  print(casting);
}
#+END_SRC

#+RESULTS:
: {jed: false, George: false}

* [38-Map] Map의 값을 삭제 remove()사용.
- remove는 함수다. 이 함수를 사용해서 삭제할 수 있다.
#+BEGIN_SRC dart
  void main(){
    Map<String,bool> casting = {
      'George': true,
      'Fat': false,
  };
  casting.remove('George');
  print(casting);
  }
#+END_SRC

#+RESULTS:
: {Fat: false}

* [39-Map] keys와 values 가져오기
- keys와 values는 변수다.
- kesy와 values는 iterable을 return한다.
#+BEGIN_SRC dart
  void main(){
    Map<String,int> people = {
      "Harry":33,
      "potter": 22,
      "John": 88,
      "Shelly": 86,
      };
   print(people.keys);
   print(people.values);

  }
#+END_SRC

#+RESULTS:
: (Harry, potter, John, Shelly)
: (33, 22, 88, 86)

* [40-Set] Set의 생성과 출력
- 중복을 허용하지 않는다.
  #+BEGIN_SRC dart
    void main(){
      Set<String> strset = {
        'George',
        'Harry',
        'Potter',
        };
        print(strset);
    }
  #+END_SRC

  #+RESULTS:
  : {George, Harry, Potter}

* [41-set] set에 add, remove
#+BEGIN_SRC dart
  void main(){
    Set<String> strset = {
      'john',
      'Mccarthy',
      'edward',
      };
      strset.add('mac');
      print(strset);
      strset.remove('john');
      print(strset);
  }
#+END_SRC

#+RESULTS:
: {john, Mccarthy, edward, mac}
: {Mccarthy, edward, mac}

* [42-set] contain(),포함여부 확인
#+BEGIN_SRC dart
  void main(){
    Set<String> strset = {
      'john',
      'mccarthy',
      'holy',

      };

      print(strset.contains('holy'));
  }
#+END_SRC

#+RESULTS:
: true

* [43-if] if,else if, else 기본 사용법
- if,else if,else 사용법
  #+BEGIN_SRC dart
    void main(){
      int number = 3;
      if (number % 3 ==0)
      {
        print('remainder 0');
      } else if (number % 3 == 1)
      {
          print('remainder 1');
      }else
      {
            print('remainder 2');
      }
  }
  #+END_SRC

  #+RESULTS:
  : remainder 0

* [44-switch] switch문 기본 사용법
- 각 case에는 break를 넣어야 한다.
- default case를 잊지 말아야 한다.
  #+BEGIN_SRC dart
    void main()
    {
      int number = 3;

      switch(number % 3){
        case 0:
        print("remainder 0");
        break;
        case 1:
        print("remainder 1");
        break;
        case 2:
        print("remainder 2");
        break;
        }
    }
  #+END_SRC

  #+RESULTS:
  : remainder 0

* [45-for] for-loop
#+BEGIN_SRC dart
  void main(){
    for(int i=0;i< 10;i++){
      print(i);
      }
  }
#+END_SRC

#+RESULTS:
#+begin_example
0
1
2
3
4
5
6
7
8
9
#+end_example

* [46-for] list for-loop
- for ~ in 사용법
- in 을 사용할 때 함수처럼 ()에 기술한다. 이것이 좀 특이하다.
#+BEGIN_SRC dart
  void main(){
    int total = 0;
    List<int> numbers = [1,2,3,4,5];
    for(int i in numbers){
      total += i;
      }
    print(total);
  }
#+END_SRC

#+RESULTS:
: 15

* [47-while] while 기본 사용법
#+BEGIN_SRC dart
    void main(){
      int total = 0;

      while(total <10){
        total +=1;
        }
      print(total);
  }
#+END_SRC

#+RESULTS:
: 10

* [48-while] do while 사용법
- while과 do while의 차이는 무엇인가? do는 먼저 한번 실행하고 그 다음
  반복할 뿐이다.
  #+BEGIN_SRC dart
      void main(){
        int total = 0;
        do {
          total += 1;
          } while (total <10);
        print(total);
    }
  #+END_SRC

  #+RESULTS:
  : 10

* [49-break] loop에서 if break 사용법
- break는 loop를 빠져나간다.
#+BEGIN_SRC dart
  void main(){
  int total = 0;
  while(total<10){
     total +=1;
     if(total ==5) break;
    }
  print(total);
  }

#+END_SRC

#+RESULTS:
: 5
  
* [50-continue] loop에서 if continue
#+BEGIN_SRC dart
  void main(){

    for (int i =0; i< 10; i++){
      if(i ==5){
        continue;
        }
      print(i);
      }

    }
#+END_SRC

#+RESULTS:
: 0
: 1
: 2
: 3
: 4
: 6
: 7
: 8
: 9

* [51-enum] enum의 생성과 사용
- enum은 main밖에서 선언한다.
- enum은 class keyword처럼 사용한다. 
- enum의 값은 symbol로 표시하며 보통 상태값을 표현한다.
- enum의 값에 대한 접근은 마치 static value값을 접근하듯이 한다.
- enum을 쓰는 이유: 몇가지 상태만 있는경우 그 상태를 명확하게
  해준다.string을 쓰지 않고 enum을 쓰면 코드를 명확하게 해준다.
  
  #+BEGIN_SRC dart
    enum Status{
      approved,
      pending,
      rejected,
      }
    void main(){
      Status status = Status.pending;

      if(status == Status.approved){
        print("approved!");
        }else if(status == Status.pending){
          print("pending!");
          }else{
            print("rejected");
            }
          }
  #+END_SRC

  #+RESULTS:
  : pending!

* [52- function] function과 주석 그리고 호출.
- 함수를 사용하기전 주석으로 어떤 역할을 하는 함수인지 기술한다.
  #+BEGIN_SRC dart
    void main(){
      addNumbers();
    }

    // 3개의 숫자(x,y,z)를 더한다. 더한 값이 짝수인지 홀수 인지 알려주는 함수.
    addNumbers(){
      print("addNumbers 실행");
    }
  #+END_SRC

  #+RESULTS:
  : addNumbers 실행

* [53-function] function의 구현
  #+BEGIN_SRC dart
    void main(){
      addNumbers();
    }

    // 3개의 숫자(x,y,z)를 더한다. 더한 값이 짝수인지 홀수 인지 알려주는 함수.
    addNumbers(){
      int x = 10;
      int y = 20;
      int z = 30;

      int sum = x+y+z;
      if( sum % 2 ==0){
        print("this is even");
        }else{
        print("this is odd");
      }
    }
  #+END_SRC

  #+RESULTS:
  : this is even

* [54-function] argument (positional parameter)를 만들자.
- 함수를 argument없이 사용하면 매번 호출시 매번 동일한 동작을 한다.
- argument가 주어질때, 함수는 다양한 동작이 가능해진다.
  #+BEGIN_SRC dart
    void main(){
      addNumbers(10,20,30);
    }

    // 3개의 숫자(x,y,z)를 더한다. 더한 값이 짝수인지 홀수 인지 알려주는 함수.
    addNumbers(int x, int y, int z){
      int sum = x+y+z;
      if( sum % 2 ==0){
        print("this is even");
        }else{
        print("this is odd");
      }
    }
  #+END_SRC

  #+RESULTS:
  : this is even
  
* [55-function] optional parameter
- 함수에 parameter가 없다면, 매번 똑같은 일만 수행한다. parameter로
  함수의 body를 재사용한다.
- optional parameter는 호출시 입력을 하지 않아도 된다. [ ]로 optional
  parameter를 정해준다. 여기서 문제점이 발생한다.
  
  #+BEGIN_SRC dart
    void main(){
      addNumbers(10,20,30);
    }

    // 3개의 숫자(x,y,z)를 더한다. 더한 값이 짝수인지 홀수 인지 알려주는 함수.
    addNumbers(int x, [int y, int z]){
      int sum = x+y+z;
      if( sum % 2 ==0){
        print("this is even");
        }else{
        print("this is odd");
      }
    }
  #+END_SRC
- int y , int z를 []로 묶어 주었다.
  
