content/posts/dart_practice1.md


## [56-function] optional parameter 문제점 1 {#56-function-optional-parameter-문제점-1}

-   함수 선언시 []로 optional로 정해주면, argument가 null값을 갖는데,
    int는  nullable type이 아니라서 에러가 난다.
-   int가 null을 가질 수 있게 type에 ?를 추가한다.

<!--listend-->

```dart
void main(){
  addNumbers(1)
}
addNumbers(int x,[int? y, int? z]){
  int sum = x + y + z;
  if (sum % 2 == 0){
    print('this is even');
    }else {
      print('this is odd');
    }
  }
```


## [57-function] optional의 또다른 문제점 2 해결-default값 {#57-function-optional의-또다른-문제점-2-해결-default값}

-   argument type에 ?을 추가해서 nullable하게 만들었지만, 실행되지
    않는다.
-   왜냐하면 int sum에서 y와 z가 null값이 될수 있기 때문이다. 그러면
    sum도 null이 가능하게 해야한다. 그런데 null과 숫자의 덧셈자체가
    안된다. 그래서 에러는 계속 나게 된다.
-   optional만 사용하면 null값을 갖기 때문에 꼬리에 꼬리를 무는 문제가
    계속 발생된다. 그래서 default값으로 해결한다.

<!--listend-->

```dart
void main(){
  addNumbers(3);
}

addNumbers(int x, [int y=1, int z=1]){
  int sum = x + y + z;
  if (sum % 2 == 0){
    print('this is even');
  }else{
    print('this is odd');
  }

}

```

-   optional을 적용하기 위해서 []로 묶기만 해서는 안된다. null값 문제가
    발생하기 때문이다. 그래서 default값을 같이 적용해야만 한다.


## [58-function] named parameter {#58-function-named-parameter}

-   parameter를 기술할때 optional은 []를 사용했다면, named parameter는 {}을 사용한다.
-   required라는 keyword를 사용해서 선언한다.
-   named parameter는 호출시 값만 넣어서 호출하는 일반함수와 다르게
    이름을 기술해야 한다. 그래서 named parameter다.
-   named parameter의 특징은 순서가 중요하지 않다는 것이다.

<!--listend-->

```dart
void main(){
  addNumbers(x:10,y:20,z:30);
}

addNumbers({
required int x,
required int y,
required int z,
}){
  int sum = x+y+z;
  if (sum %2 == 0){
    print("this is even");
  }
  else{
    print("this is odd");
    }
}

```


## [59-function] named parameter의 순서 {#59-function-named-parameter의-순서}

-   parameter의 순서가 상관없다.

<!--listend-->

```dart
 void main(){
   addNumbers(z:20,y:30,x:40);
 }
 addNumbers({
     required int x,
     required int y,
     required int z,
 }){
   int sum = x+y+z;
   if (sum %2 == 0){
     print("it is even");
   }else{
       print("it is odd");
   }
}
```


## [60-function] named parameter와 optional parameter의 관계 {#60-function-named-parameter와-optional-parameter의-관계}

-   named parameter는 required로 기술한다. required를 제거하면 optional
    parameter가 된다.
-   optional은 null문제가 있어서 항상 default를 처리해줘야 한다.

<!--listend-->

```dart
void main(){
  addNumbers(x:10,y:20,z:30);
}

addNumbers({
    required int x,
    required int y,
    int z=50,      }){
  int sum = x + y + z;
  if( sum %2 == 0){
    print("this is 짝수");
  } else{
    print("this is odd");
    }
    }



```


## [61-function] positional parameter와 named parameter같이 사용 {#61-function-positional-parameter와-named-parameter같이-사용}

```dart
void main(){
  addNumbers(10,y:20,z:30);
}

addNumbers(int x,{
    required int y,
    required int z,}){
  int sum = x + y + z;
  if (sum % 2 == 0){
    print('this is even');
  }else{
    print('this is odd');
    }
    }


```


## [62-function] addNumbers에 return값 처리 {#62-function-addnumbers에-return값-처리}

-   return하는 함수를 작성하자.

<!--listend-->

```dart
void main(){
  int results = addNumbers(x:30,y:30,z:10);
  print(results);
}

int addNumbers({
    required int x,
    required int y,
    required int z,
    }){

      int sum = x + y + z;
      return sum;

      }
```


## [62-function] arrow function {#62-function-arrow-function}

-   addNumbers 를 arrow function으로 만들자.
-   arrow function의 body는 중괄호도 사용하지 않는다.
-   arrow function은 body 계산값이 반드시 return된다.

<!--listend-->

```dart
void main(){
  addNumbers(x:10,y:20,z:30);
}
addNumbers({
    required int x,
    required int y,
    required int z,
    }) => x+ y + z;

```


## [63-typedef] typedef 생성 {#63-typedef-typedef-생성}

-   함수와 비슷하지만 body가 없다.
-   함수의 인자와 return값을 표현하는 게 function signiture다.
-   typedef typdefinition으로 function definition을 만드는것이다. 문법에
    유의하자.

<!--listend-->

```dart
void main(){

}
typedef Operation = int Function(int x, int y, int z);
```


## [64-typedef] typedef 사용법 (add, substract) {#64-typedef-typedef-사용법--add-substract}

-   function signiture를 만들면 fuction signiture와 일치하는 함수를
    symbolic mapping할 수 있다.
-   add와 subtract를 function signiture에 맞춰 만들고, symbolic
    mapping해서 사용하는 예다.

<!--listend-->

```dart
void main(){

  Operation op = add;
  int result = op(3,2,1);
  print(result);
  Operation op2 = substract;
  int result2 = op(11,2,3);
  print(result2);
}

typedef Operation = int Function(int x, int y, int z);
int add(int x, int y, int z) => x + y + z;
int substract(int x, int y , int z) => x - y -z;

```


## [65-typedef] typedef 실제 사용예 {#65-typedef-typedef-실제-사용예}

-   typedef는 function의 signiture를 만든다.
-   function signiture는 함수의 인자로 들어가서 사용될 수 있다.

<!--listend-->

```dart
typedef Operation = int Function(int x, int y, int z);
int add(int x,int y, int z) => x+y+z;
int substract(int x,int y, int z) => x-y-z;

int calculate(int x, int y, int z, Operation op){
  return op(x,y,z);
  }

void main(){
  calculate(3,3,3,add);

}
```
